package classEx2;
/*
 		클래스{
 			필드 : 인스턴스 변수 (private) 외부 노출을 시키지 말자! 대신 getter, setter, 생성자 등으로
 			       입력값을 넣어서 관리한다!
 			       
 			메서드
 				-생성자 : 인스턴스 만들 때, 초기값을 넣을 수 있다.
 				리턴타입이 없다! 클래스명과 동일하다!
 				보편적으로 public으로 사용한다
 				
 				 1)기본 생성자
 				 	-컴파일러가 자동으로 만들어 준다.
 				 	-단, 다른 생성자가 없을 때만 자동으로 만든다!
 				 2)인수 있는 생성자
 				 	-필드에 따라 여러개의 생성자를 만들 수 있다( : 오버로딩)
 				 	
 				-getter / setter
 					1)값 수정할 때 필요하다!
 					2)생성자가 없는 경우도 있기 때문에, setter를 이용해서 값 입력이 가능하다
 					
 				-일반 메서드(비즈니스 메서드)
 					1)클래스의 기능을 담당한다.
 					2)필요에 따라 public, private을 적절히 사용하자!

 			※우리가 만드는 클래스는 데이터 모델링
 			
 */
public class ClassTest06 {
	
		
	public static void main(String[] args) {
		
	
		
		
		
		
		
		
		
		
		

	}
}

















